[{"title":"American Airlines Terms On Distribution Cost Shift Prompt Pushback","url":"https://www.thecompanydime.com/aa-terms-distribution-cost-ndc-travel-management-companies/","description":"\n\t\tSome travel management company representatives are unhappy with revisions to American Airlines’ ARC agreement addendum that set conditions for fees charged to their clients on bookings with the airline. Some TMCs have told clients they would need to charge higher fees on…\n\t","date":"May 17, 2023"},{"title":"CWT Invests In Reporting To Join Separately Booked Trip Components","url":"https://www.thecompanydime.com/cwt-reporting/","description":"\n\t\tCWT earmarked some of its development budget for new trip reporting that pulls in info from multiple bookings to make client data more comprehensive. The travel management company expects it to roll out early next year as part of a new analytics…\n\t","date":"October 18, 2022"},{"title":"Frustrated With Airlines’ GDS Bypass Programs And Threats, BCD Travel Pays Microsoft To Build An Agent Desktop","url":"https://www.thecompanydime.com/bcd-microsoft-agent-desktop/","description":"\n\t\tBCD Travel is paying Microsoft about $20 million for a multi-GDS search and booking desktop system that also could help agents manage bookings made outside the global distribution systems. The travel management company a decade ago retired a similar initiative after airlines…\n\t","date":"February 9, 2020"},{"title":"New Reporting Takes TripLink A Step Forward","url":"https://www.thecompanydime.com/triplink-reporting/","description":"\n\t\tLeesburg, Va. — It’s not uncommon to find travel managers who believe in Concur’s vision for TripLink but question whether it’s ready. Aggressive marketing has inflated expectations. Concur has acknowledged that building the service takes a long time. Maybe the mantra now should be “slow…\n\t","date":"October 2, 2015"},{"title":"Visa, United Add Key Piece To Ancillary Reporting Puzzle","url":"https://www.thecompanydime.com/airline-ancillary/","description":"\n\t\tIt was a long time coming, but standardized, global credit card reporting on ancillary airline spending is finally in place — at least for United Airlines’ corporate accounts using Visa cards. The airline in April began sending data through Visa using defined…\n\t","date":"July 23, 2015"},{"title":"End Of An Era As Carlson Family Agrees To Reduce Equity To Cut CWT’s Debt","url":"https://www.thecompanydime.com/carlson-family-cwt-debt-restructuring/","description":"\n\t\tThe descendants of Curt Carlson will no longer serve on CWT’s board of directors under a proposed financial restructuring, announced Wednesday, to repair the travel management company’s balance sheet and dilute the family’s stake. Holders of over 90 percent of CWT’s outstanding…\n\t","date":"September 15, 2021"},{"title":"Morgan Stanley: Corporate Travel Prospects Weaken","url":"https://www.thecompanydime.com/morgan-stanley-corporate-travel/","description":"\n\t\tNew research by Morgan Stanley analysts suggested the prolonged period of strong corporate travel demand may hit speed bumps this year. After surveying 203 corporate travel managers last month, Morgan Stanley concluded that “travel budget expectations are the lowest they’ve been in…\n\t","date":"April 3, 2019"}]