[{"title":"United CEO says Russian airspace should be off-limits to all carriers flying U.S. routes","url":"https://www.travelweekly.com//Travel-News/Airline-News/United-CEO-Scott-Kirby-on-Russian-airspace","description":"U.S. airlines are prohibited from flying over Russian airspace but foreign carriers are not. Flying over Russia is especially an issue on flights to China and India.","date":"Tue, 6 Jun 2023  "},{"title":"Diving deeper into AA's addendum","url":"https://www.travelweekly.com//Mark-Pestronk/Diving-deeper-into-AA-addendum","description":"Let's dig into American Airlines' addendum and what it means for travel agents.","date":"Fri, 26 May 2023  "},{"title":"Airline ticket demand appears to be declining","url":"https://www.travelweekly.com//Travel-News/Airline-News/Airline-ticket-demand-appears-to-be-declining","description":"Consumer demand for air travel fell significantly in April, according to a Bank of America analysis. Also, ARC data suggests that sales are moderating.","date":"Tue, 16 May 2023  "},{"title":"Nasty surprises in AA's addendum","url":"https://www.travelweekly.com//Mark-Pestronk/Nasty-surprises-in-AA-addendum","description":"The document contains a bunch of surprises -- all bad -- for all agencies that issue airline tickets. Corporate agencies, or TMCs, are especially targeted, but the new rules also affect leisure travel","date":"Mon, 15 May 2023  "},{"title":"ARC's new API expands payment processing beyond GDSs","url":"https://www.travelweekly.com//Travel-News/Travel-Technology/ARC-new-API-expands-payment-processing-beyond-GDSs","description":"ARC said the new solution enables agencies to process payments with supplier-direct and NDC workflows.","date":"Tue, 2 May 2023  "},{"title":"Airline NDC strategies: What’s next for airlines and travel agencies?","url":"https://www.travelweekly.com//Podcasts/Folo/Airline-NDC-strategies","description":"Editors Robert Silk and Rebecca Tobin talk NDC with distribution expert Cory Garner. Why has American become a lightning rod for criticism? What are other airlines' strategies? What drives change? And","date":"Tue, 2 May 2023  "},{"title":"American Airlines is pleased with its NDC rollout","url":"https://www.travelweekly.com//Travel-News/Airline-News/American-Airlines-pleased-NDC-rollout","description":"The early days of American's NDC full-content strategy have gone well, company executives asserted on Thursday during the airline's Q1 earnings call.","date":"Thu, 27 Apr 2023  "},{"title":"JetBlue will reduce summer capacity due to shortage of air traffic controllers","url":"https://www.travelweekly.com//Travel-News/Airline-News/JetBlue-will-reduce-summer-capacity","description":"JetBlue is one of multiple carriers to take advantage of the FAA's voluntary 10% slot reductions for the peak summer period, particularly for the New York region.","date":"Wed, 26 Apr 2023  "},{"title":"Consumer Travel Editors Roundtable: Roadtrip","url":"https://www.travelweekly.com//Agent-Issues/Consumer-Travel-Editors-Roundtable-2023/355181","description":"At Costa Rica's Nayara Resort, top travel editors tackled topics such as the demand surge, luxury, cannabis, cruise, sustainability and greenwashing.","date":"Tue, 25 Apr 2023  "},{"title":"March was a record month for ARC","url":"https://www.travelweekly.com//Travel-News/Travel-Agent-Issues/March-was-a-record-month-for-ARC","description":"ARC said air ticket sales in March totaled more than $9.6 billion, a 22% increase year over year and the highest monthly total ARC has ever recorded.","date":"Thu, 20 Apr 2023  "}]